# -*- coding: utf-8 -*-
# enter 3 int
# довжина кожного відрізка менша від суми довжин двох інших відрізків
# perimetr
# surface

print "Введіть довжини сторін трикутника"
a = int(raw_input("a = "))
b = int(raw_input("b = "))
c = int(raw_input("c = "))

if a < b + c and b < a + c and c < a + b:
    print "вітаємо, такий трикутник можливий!"
    p = (a + b + c) / 2.
    print "периметр такого трикутника становить:", (a + b + c)
    print "його площа становить:", (p * (p - a) * (p - b) * (p - c))**0.5, "кв.од."
else:
    print "нажаль, такий трикутник неможливий"
